#pragma once
//=============================================================================
//  
// フィールドの描画
//
//=============================================================================

#ifndef _FIELD_H_
#define _FIELD_H_

//*****************************************************************************
// 基底クラス
//*****************************************************************************
//フィールドクラス
class Field
{
public:
	Field();//コンストラクタ
	~Field();//デストラクタ
	void Update(void);//更新処理
	void Draw(void);//描画処理
	void Uninit(void);//終了処理
	//*****************************************************************************
	// メンバ変数
	//*****************************************************************************
	//Xモデル表示用変数
	LPD3DXMESH pMesh = NULL;
	DWORD dwNumMaterials = 0;
	D3DMATERIAL9* pMeshMaterials = NULL;
	LPDIRECT3DTEXTURE9* pMeshTextures = NULL;

	//ワールド行列
	D3DXMATRIX mtxWorld;
	//スケール
	D3DXMATRIX mtxWorldS;//拡大用変数
	//トランスレーション
	D3DXMATRIX mtxWorldT;//移動用変数
	D3DXVECTOR3 pos;//座標
};

//*****************************************************************************
// 派生クラス
//*****************************************************************************
//地面クラス
class Zimen:public Field
{
public:
	Zimen();//コンストラクタ
	~Zimen();//デストラクタ
	void Init(void);//初期化処理
};
//スカイドームクラス
class SkyDome:public Field
{
public:
	SkyDome();//コンストラクタ
	~SkyDome();//デストラクタ
	void Init(void);//初期化処理
};

#endif // _FIELD_H_


